//#include<stdio.h>
//
//int main()
//{
//	/*
//		1，定义数组存储5个学生的年龄，并初始化。
//		2，定义数组存储你女朋友的身高，并初始化。
//
//			数组的定义并初始化的格式：
//				数据类型 数组名[长度] = {数据1，数据2...}；
//			细节1：
//				如果数组的长度没有写，数据值的个数就是数组的长度
//			细节2：
//				如果数组的长度已经写上，数据值的个数 <= 长度
//				未赋值的部分有默认值
//				整数：0
//				小数：0.0
//				字符：'\0'
//				字符串:NULL（什么都没有）
//
//	*/
//
//	// 1.定义数组存储5个学生的年龄，并初始化。
//	int arr1[5] = {17, 18, 19, 20, 21};
//	int arr2[] = {17, 18, 19, 20, 21};
//
//
//	// 2.定义数组存储你女朋友的身高，并初始化。
//	double arr3[2] = {1.68, 1.53};
//	double arr4[] = {1.68, 1.53};
//	// 如果我的两个女朋友的身高，我都不知道
//	double arr5[2] = {0.0};
//
//
//
//
//
//	return 0;
//}