//#include<stdio.h>
//
//
//int sum(int base, int additional)
//{
//	printf("111");
//	int sum = base + additional;
//	return sum;
//}
//
//
//
//
//int main()
//{
//
//	/*
//		需求： 小慧慧考试成绩：基础题得分93，附加题得分10。
//			  小丹丹考试成绩：基础题得分87，附加题得分9。
//			  请问，谁的总分更高？
//
//		最终格式：
//			返回值类型 函数名（形参，....）
//			{
//				函数体；
//				return 返回值；
//			}
//		
//		调用方式：
//			用变量去接收函数的结果
//			printf("占位符"，  函数的调用);
//
//		提高了代码的复用性
//		提高了代码的可维护性
//
//
//	*/
//
//	
//	// 1.调用函数计算小慧慧的考试总分
//	int score1 = sum(93,10);
//
//	// 2.调用函数计算小丹丹的考试总分
//	int score2 = sum(87, 9);
//
//	// 3.判断
//	if (score1 > score2)
//	{
//		printf("小慧慧的考试成绩更高");
//	}
//	else if (score1 < score2)
//	{
//		printf("小丹丹的考试成绩更高");
//	}
//	else
//	{
//		printf("两个人的考试成绩是一样的");
//	}
//	return 0;
//}