//#include<stdio.h>
//#include<stdlib.h>
//#include<time.h>
//
//int main()
//{
//
//	/*
//		随机数的两个小弊端：
//			1.种子不变，随机数结果是固定的
//			2.随机数的范围
//			默认范围：0 ~ 32767
//
//			任意的范围之内获取一个随机数：
//			1 - 100
//			7 - 23
//			8 - 49
//
//			课堂练习：
//				1. 12 ~ 87 
//				2. 17 ~ 39（不包含39）
//
//		绝招：用于生成任意范围之内的随机数
//		1. 把这个范围变成包头不包尾，包左不包右的 8 - 50
//		2. 拿着尾巴 - 开头	50 - 8 = 42
//		3. 修改代码
//			
//	*/
//
//
//	// 1.设置种子
//	srand(time(NULL));
//
//	// 2.获取随机数
//	int num = rand() % 42 + 8; // 0 - 41 + 8     8 - 49
//	// 3.输出打印
//	printf("%d\n", num);
//
//
//
//
//	return 0;
//}
