//#include<stdio.h>
//
//int main()
//{
//
//
//	/*
//		需求：定义一个数组存储5个学生的名字并进行遍历
//
//		字符串的底层其实就是字符数组
//		把多个字符数组，再放入到一个大的数组当中
//		二维数组
//	*/
//
//	// 1.定义一个二维数组，存储多个学生的名字
//	char strArr[5][100] =
//	{
//		"zhangsan",
//		"lisi",
//		"wangwu",
//		"zhaoliu",
//		"qianqi"
//	};
//
//	// 2.遍历二维数组
//	for (int i = 0; i < 5; i++)
//	{
//		// i:依次表示二维数组中的每一个索引
//		char* str = strArr[i];
//		printf("%s\n", str);
//	}
//
//	// 第二种方式
//	// 把五个字符串的指针，放入到一个数组当中
//	// 指针数组
//	char* strArr2[5] =
//	{
//		"zhangsan",
//		"lisi",
//		"wangwu",
//		"zhaoliu",
//		"qianqi"
//	};
//
//	// 遍历指针数组
//	for (int i = 0; i < 5; i++)
//	{
//		// i: 依次表示数组中的每一个索引
//		char* str = strArr2[i];
//		printf("%s\n", str);
//	}
//
//	
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//	return 0;
//}