//#include<stdio.h>
//
//int main()
//{
//
//	/*
//		需求：
//			定义一个长度为5的数组，并进行初始化：1 2 3 4 5
//		完成下列要求：
//			遍历数组，并把每一个元素打印到控制台
//	*/
//
//	
//	// 1.定义一个长度为5的数组，并进行初始化：1 2 3 4 5
//	int arr[] = {1,2,3,4,5};
//
//	// 2.获取
//	/*printf("%d\n", arr[0]);
//	printf("%d\n", arr[1]);
//	printf("%d\n", arr[2]);
//	printf("%d\n", arr[3]);
//	printf("%d\n", arr[4]);*/
//
//	// 利用循环遍历数组
//	//int len = 长度;
//	for (int i = 0; i < 5; i++)
//	{
//		// i:依次表示数组里面的每一个索引
//		printf("%d\n", arr[i]);
//	}
//	
//	
//
//
//
//
//
//	return 0;
//}